In [ ]:
pwd

In [ ]:
cd C:/Mehul Session/Session 27_Python Introduction

In [6]:
import pandas as pd
import numpy as np
data=pd.read_csv("Python_Pandas_Replace_Values_CSV_Filestopic_added1611217507s_p550033606.csv")
data

         Date       Age Sales        Day
0  01/01/2019  32 Years  6 Cr     Monday
1  01/02/2019       NaN     9    Tuesday
2  01/03/2019        28   NaN  Wednesday
3  01/04/2019       NaN     7        NaN
4  01/05/2019  32 Years   NaN     Monday
5  01/06/2019       NaN   NaN    Tuesday
6  01/07/2019       NaN   NaN        NaN
7  01/08/2019        34  8 Cr   Thrusday
8  01/09/2019        40    12    Tuesday

In [8]:
data.replace(np.NaN, "Abbas")

         Date       Age  Sales        Day
0  01/01/2019  32 Years   6 Cr     Monday
1  01/02/2019     Abbas      9    Tuesday
2  01/03/2019        28  Abbas  Wednesday
3  01/04/2019     Abbas      7      Abbas
4  01/05/2019  32 Years  Abbas     Monday
5  01/06/2019     Abbas  Abbas    Tuesday
6  01/07/2019     Abbas  Abbas      Abbas
7  01/08/2019        34   8 Cr   Thrusday
8  01/09/2019        40     12    Tuesday

In [7]:
data.dtypes

Date     object
Age      object
Sales    object
Day      object
dtype: object

In [8]:
data=data.replace('Years', ' ', inplace=True)
data

AttributeError: 'NoneType' object has no attribute 'replace'

In [3]:
data

         Date       Age Sales        Day
0  01/01/2019  32 Years  6 Cr     Monday
1  01/02/2019       NaN     9    Tuesday
2  01/03/2019        28   NaN  Wednesday
3  01/04/2019       NaN     7        NaN
4  01/05/2019  32 Years   NaN     Monday
5  01/06/2019       NaN   NaN    Tuesday
6  01/07/2019       NaN   NaN        NaN
7  01/08/2019        34  8 Cr   Thrusday
8  01/09/2019        40    12    Tuesday

In [ ]:
new_data=data[].replace('28',np.NaN)

In [ ]:
x=data

In [ ]:
x = x['Age'].replace('32 Years', 'Abbas')
x

In [ ]:
#Replacing single value
new_data = data.replace(-99999, value=np.NaN)
new_data

In [ ]:
new_data = data.replace([-909,-876], '100')
new_data

In [ ]:
#Replacing list with single value
new_data = data.replace(['32 Years','34','40'], 0)
new_data

In [ ]:
a={
        'Age':'28',
        'Sales': '7',
        'Day': 'Monday'
    }

b={
        'Age':'data',
        'Sales': 'Sc',
        'Day': 'FT'
    }

In [ ]:
x=data

In [ ]:
x

In [ ]:
#Replacing per column
x = x.replace(a, b)
x

In [ ]:
data

In [ ]:
#Replacing special value by using mappinng


y = y.replace({
        'Tuesday': np.nan,   
        'Monday': 'Sunday',
    })
y

In [11]:
data

In [ ]:
z=data
z

In [1]:
data

NameError: name 'data' is not defined

In [ ]:
data=data.replace('Years',' ', inplace=True)

In [8]:
z=data
z

         Date       Age Sales        Day
0  01/01/2019  32 Years  6 Cr     Monday
1  01/02/2019       NaN     9    Tuesday
2  01/03/2019        28   NaN  Wednesday
3  01/04/2019       NaN     7        NaN
4  01/05/2019  32 Years   NaN     Monday
5  01/06/2019       NaN   NaN    Tuesday
6  01/07/2019       NaN   NaN        NaN
7  01/08/2019        34  8 Cr   Thrusday
8  01/09/2019        40    12    Tuesday

In [12]:
z = z.replace('Years', '', regex=True)
z

         Date  Age Sales        Day
0  01/01/2019  32     6      Monday
1  01/02/2019  NaN     9    Tuesday
2  01/03/2019   28   NaN  Wednesday
3  01/04/2019  NaN     7        NaN
4  01/05/2019  32    NaN     Monday
5  01/06/2019  NaN   NaN    Tuesday
6  01/07/2019  NaN   NaN        NaN
7  01/08/2019   34    8    Thrusday
8  01/09/2019   40    12    Tuesday

In [13]:
data

         Date       Age Sales        Day
0  01/01/2019  32 Years  6 Cr     Monday
1  01/02/2019       NaN     9    Tuesday
2  01/03/2019        28   NaN  Wednesday
3  01/04/2019       NaN     7        NaN
4  01/05/2019  32 Years   NaN     Monday
5  01/06/2019       NaN   NaN    Tuesday
6  01/07/2019       NaN   NaN        NaN
7  01/08/2019        34  8 Cr   Thrusday
8  01/09/2019        40    12    Tuesday

In [14]:
#Regex-Regular Expression
# when Age is 32 Years, Sales is 6 lacs etc.
z = z.replace({
    'Age': '[A-Za-z]', 
    'Sales': '[A-Za-z]'
},'', regex=True) 
z

         Date  Age Sales  Day
0  01/01/2019  32     6
1  01/02/2019  NaN     9
2  01/03/2019   28   NaN
3  01/04/2019  NaN     7  NaN
4  01/05/2019  32    NaN
5  01/06/2019  NaN   NaN
6  01/07/2019  NaN   NaN  NaN
7  01/08/2019   34    8
8  01/09/2019   40    12

In [1]:
data

NameError: name 'data' is not defined

In [ ]:
z=data
z

In [15]:
#Replacing list with another list
#creating a new data frame
df = pd.DataFrame({
    'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional'],
    'student': ['Maya', 'Rakesh', 'Rajiv', 'Harry', 'jinal', 'Shubham']
})
df

         score  student
0  exceptional     Maya
1      average   Rakesh
2         good    Rajiv
3         poor    Harry
4      average    jinal
5  exceptional  Shubham

In [16]:
new_df=df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])
new_df

   score  student
0      4     Maya
1      2   Rakesh
2      3    Rajiv
3      1    Harry
4      2    jinal
5      4  Shubham

In [20]:
new_df.to_csv("abc.csv", index=False)

In [ ]:
#Write csv file/export csv file(it includes index)
data.to_csv("any.csv")

In [23]:
data.isnull().mean()

Date     0.000000
Age      0.444444
Sales    0.444444
Day      0.222222
dtype: float64